## This is Markdown Cell

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [7]:
df = pd.read_csv('Online_Retail_Data.csv')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,01-12-2010 08:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,01-12-2010 08:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,01-12-2010 08:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,01-12-2010 08:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,01-12-2010 08:26,3.39,17850.0,United Kingdom

In [12]:
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
1114,536527,22243,5 HOOK HANGER RED MAGIC TOADSTOOL,12,01-12-2010 13:04,1.65,12662.0,Germany
1115,536527,47421,ASSORTED COLOUR LIZARD SUCTION HOOK,24,01-12-2010 13:04,0.42,12662.0,Germany
1116,536527,20712,JUMBO BAG WOODLAND ANIMALS,10,01-12-2010 13:04,1.95,12662.0,Germany
1117,536527,20713,JUMBO BAG OWLS,10,01-12-2010 13:04,1.95,12662.0,Germany
1118,536527,22837,HOT WATER BOTTLE BABUSHKA,4,01-12-2010 13:04,4.65,12662.0,Germany

In [13]:
df.shape

(1119, 8)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1119 entries, 0 to 1118
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    1119 non-null   object
 1   StockCode    1119 non-null   object
 2   Description  1118 non-null   object
 3   Quantity     1119 non-null   int64
 4   InvoiceDate  1119 non-null   object
 5   UnitPrice    1119 non-null   float64
 6   CustomerID   1118 non-null   float64
 7   Country      1119 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 70.1+ KB

In [15]:
df.duplicated().sum()

25

In [16]:
df.describe()

          Quantity    UnitPrice    CustomerID
count  1119.000000  1119.000000   1118.000000
mean     11.867739     3.017328  15855.558140
std      36.458058     5.632956   1859.212846
min     -24.000000     0.000000  12431.000000
25%       1.000000     1.250000  14307.000000
50%       4.000000     2.100000  15983.000000
75%      10.000000     3.750000  17897.000000
max     600.000000   165.000000  18085.000000